name: "JointAndImageStateRegressionNet"
layer {
  name: "data"
  type: "HDF5Data"
  top: "position"
  top: "rgb_frames+0"
  top: "rgb_frames+1"
  hdf5_data_param {
    source: "examples/vgps/train_pose_slow.txt"
    batch_size: 25
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "HDF5Data"
  top: "position"
  top: "rgb_frames+0"
  top: "rgb_frames+1"
  hdf5_data_param {
    source: "examples/vgps/val_pose_slow.txt"
    batch_size: 10
  }
  include: {
    phase: TEST
    stage: 'test-on-val'
  }
}
layer {
  name: "data"
  type: "HDF5Data"
  top: "position"
  top: "rgb_frames+0"
  top: "rgb_frames+1"
  hdf5_data_param {
    source: "examples/vgps/train_pose_slow.txt"
    batch_size: 10
  }
  include: {
    phase: TEST
    stage: 'test-on-train'
  }
}

layer {
  name: "concat+1"
  type: "Concat"
  bottom: "rgb_frames+0"
  bottom: "rgb_frames+1"
  top: "rgb_frames"
  concat_param {
    axis: 0
  }
}

layer {
  name: "lrn"
  type: "LRN"
  bottom: "rgb_frames"
  top: "lrn_frames"
  lrn_param {
    norm_region: WITHIN_CHANNEL
    alpha: 5e-05
    beta: 0.75
  }
}

# Image Processing Layers
layer {
  name: "conv1/7x7_s2"
  type: "Convolution"
  bottom: "lrn_frames"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}


layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 2
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "softmax"
  type: "SpatialSoftmax"
  bottom: "conv3"
  top: "conv3"
  spatial_softmax_param {
    engine: CAFFE
    temperature: 1.0
#    dimension: "spatial"
  }
}
layer {
  name: "fc_images"
  type: "InnerProduct"
  bottom: "conv3"
  top: "featurepoint_xy_all"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2  # dimensionality will actually be 2*num_channels
    axis: -2
    weight_filler {
      type: "expectation"
      expectation_option: "xy"
      width: 109
      height: 109
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "slice"
  type: "Slice"
  bottom: "featurepoint_xy_all"
  top: "featurepoint_xy"
  top: "featurepoint_xy+1"
  slice_param {
    axis: 0
    slice_point: 25 # Needs to be equal to the batch size
  }
  include: {phase: TRAIN}
}
layer {
  name: "slice"
  type: "Slice"
  bottom: "featurepoint_xy_all"
  top: "featurepoint_xy"
  top: "featurepoint_xy+1"
  slice_param {
    axis: 0
    slice_point: 10 # Needs to be equal to the batch size
  }
  include: {phase: TEST}
}

layer {
  name: "slowness_loss" # This is going to be output/loss #0 because it comes first in the prototxt
  type: "EuclideanLoss"
  bottom: "featurepoint_xy"
  bottom: "featurepoint_xy+1"
  top: "featurepoint_slowness"  # Lower number means points are closer together/temporally smooth/slow
  loss_weight: 0.5  # This will need to be tuned.
}

layer {
  name: "fc1_smaller"
  type: "InnerProduct"
  bottom: "featurepoint_xy"
  top: "image_features_smaller"
  param {
    lr_mult: 5
    decay_mult: 1
  }
  param {
    lr_mult: 10
    decay_mult: 0
  }
  inner_product_param {
    num_output: 9
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "euc_distance"
  type: "EuclideanDistance"
  bottom: "image_features_smaller"
  bottom: "position"
  top: "average_distance"
  include: {phase: TEST}
}

layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "image_features_smaller"
  bottom: "position"
  top: "euclidean_error"
  loss_weight: 1
}

#layer {
#  name: "output_lrn"
#  type: HDF5_OUTPUT
#  hdf5_output_param {
#    file_name: "examples/vgps/data/lrn_output_exposure.h5"
#  }
#  bottom: "lrn_frames"
#  bottom: "rgb_frames"
#  include: {
#    phase: TEST
#  }
#}

