name: "JointStateRegressionNet"
layers {
  name: "data"
  type: HDF5_DATA
  top: "joint_states"
  top: "loss_weights"
  top: "output_torques"
  hdf5_data_param {
    source: "examples/vgps/train_joint.txt"
    batch_size: 100
  }
  include: { phase: TRAIN }
}
layers {
  name: "data"
  type: HDF5_DATA
  top: "joint_states"
  top: "output_torques"
  top: "loss_weights"
  hdf5_data_param {
    source: "examples/vgps/val_joint.txt"
    batch_size: 100
  }
  include: { phase: TEST }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "joint_states"
  top: "jsrelu"
}
layers {
  name: "fc1"
  type: INNER_PRODUCT
  bottom: "jsrelu"
  top: "fc1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 40
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "fc1"
  top: "fc1relu"
}
layers {
  name: "fc2"
  type: INNER_PRODUCT
  bottom: "fc1relu"
  top: "fc2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 40
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "fc3"
  type: INNER_PRODUCT
  bottom: "fc2"
  top: "fc3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "loss"
  type: WEIGHTED_EUCLIDEAN_LOSS
  bottom: "fc3"
  bottom: "output_torques"
  bottom: "loss_weights"
  top: "euclidean_error"
}
